[
    {
        "category": "daily",
        "title": "Weather and Seasons",
        "phrases": [
            {
                "khmer": "អ្នកនឹងមានពេលវេលាដើម្បីបង្ហាញថាទេសចរិយា?",
                "english": "What's the weather like today?",
                "audio": ""
            },
            {
                "khmer": "ទេសចរិយាក្នុងមេរោគនេះទៅហើយ។",
                "english": "It's raining heavily outside.",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំចូលរួមការសម្លាប់ក្នុងរយៈពេលល្ងាច។",
                "english": "I love the cool breeze in the evening.",
                "audio": ""
            },
            {
                "khmer": "តើអ្នកចូលចិត្តជាងកាត់ដេកឬកម្មង់ខ្លួន?",
                "english": "Do you prefer summer or winter?",
                "audio": ""
            },
            {
                "khmer": "នេះមើលទៅមានពិសេសណាគឺថ្ងៃចុងក្រោយដល់កន្លែងដែលមានទាំងស្រុង។",
                "english": "Let's go for a walk in the park.",
                "audio": ""
            }
        ]
    },
    {
        "category": "travel",
        "title": "Transportation and Directions",
        "phrases": [
            {
                "khmer": "តើខ្ញុំអាចទទួលបានដើម្បីធ្វើដំណើរទៅក្នុងអាកាសម្រេចពីទីនេះ?",
                "english": "How can I get to the airport from here?",
                "audio": ""
            },
            {
                "khmer": "សូមសង្ឃឹម, ទទួលសុវត្ថិភាពនៅតាមចំណងជើងប្រសិនបើអ្នកនេះ។",
                "english": "Excuse me, where is the nearest bus stop?",
                "audio": ""
            },
            {
                "khmer": "តើអ្នកអាចចូលចិត្តឲ្យប្រើការដើរទៅផ្លូវសណ្ឋាគារបានទេ?",
                "english": "Could you please give me directions to the train station?",
                "audio": ""
            },
            {
                "khmer": "តើមានការចាប់ពីព្រឹត្តិការណ៍ស្តុកដើម្បីជួបពួកគេទេ?",
                "english": "Is there a taxi stand around here?",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំត្រូវការធ្វើការប្រសើរពីការចូលចិត្តបំផុត។",
                "english": "I'm looking for the subway entrance.",
                "audio": ""
            }
        ]
    },
    {
        "category": "social",
        "title": "Hobbies and Interests",
        "phrases": [
            {
                "khmer": "តើអ្នកចូលចិត្តឲ្យធ្វើអ្វីក្នុងពេលទេសចរិយា?",
                "english": "What do you like to do in your free time?",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំចូលចិត្តទៅកាន់ការអានសៀវភៅនិងកាសែតភាពវត្ថុ។",
                "english": "I enjoy reading books and listening to music.",
                "audio": ""
            },
            {
                "khmer": "តើអ្នកបានឃើញនូវការគួរសារមួយឬទទួលបានដែរទេ?",
                "english": "Have you ever tried painting or drawing?",
                "audio": ""
            },
            {
                "khmer": "ចូលចិត្តទៅរស់នៅទីស្នាក់នេះទើបចូលចិត្តកំពុងសម្រេច។",
                "english": "Let's go for a hike this weekend.",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំគិតថាខ្ញុំចូលចិត្តធ្វើការមួយក្នុងក្រុមអាហារទេពងទៅ។",
                "english": "I'm thinking of joining a cooking class.",
                "audio": ""
            }
        ]
    },
    {
        "category": "shopping",
        "title": "Clothing and Fashion",
        "phrases": [
            {
                "khmer": "តើអ្នកដឹងថាតើខ្ញុំអាចរកឃ្លោកនៅក្នុងស្រុកនេះបានទេ?",
                "english": "Do you know where I can find jeans in this mall?",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំត្រូវការទទួលបានហាងប្រសើរជាមួយសំណើចសម្រាប់រង្វាស់។",
                "english": "I need to buy a new pair of shoes for the party.",
                "audio": ""
            },
            {
                "khmer": "ការនេះទាក់ទងពិសេសដល់អ្នក!",
                "english": "This dress looks great on you!",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំត្រូវការរស់នៅបន្ទប់សម្រាប់ការជួយពិតប្រាកដទេពង។",
                "english": "I'm looking for a formal outfit for an interview.",
                "audio": ""
            },
            {
                "khmer": "តាមបណ្តាញអ៊ីនធឺណិតជាក់ស្តែងបំផុតទំនិញគំរូថ្មី។",
                "english": "Let's check out the latest fashion trends online.",
                "audio": ""
            }
        ]
    },
    {
        "category": "education",
        "title": "Learning a New Language",
        "phrases": [
            {
                "khmer": "តើអ្នកដឹងថាតើមានអ្វីប្រចាំទុកនៅក្នុងភាសាអេស្បួប?",
                "english": "How do you say 'hello' in Spanish?",
                "audio": ""
            },
            {
                "khmer": "ខ្ញុំកំពុងចាប់ប្រើភាសាបារាំងរបស់ខ្ញុំ។",
                "english": "I'm practicing my French pronunciation.",
                "audio": ""
            },
            {
                "khmer": "តើអ្នកចង់មើលម៉ូឌុលពាក់កណ្តាលរបស់ការបង្រៀនពីម្សិលមិញទេ?",
                "english": "Let's review the vocabulary from yesterday's lesson.",
                "audio": ""
            },
            {
                "khmer": "តើអ្នកចង់ចូលរួមនៅក្នុងក្រុមប្រឹក្សាភាសារបស់ខ្ញុំទេ?",
                "english": "Do you want to join a language exchange group?",
                "audio": ""
            },
            {
                "khmer": "ការមើលរឿងនៅក្នុងភាសាដែលកន្លែងនេះជាជំនួយដល់ការរៀនប្រើ។",
                "english": "Watching movies in the target language helps with learning.",
                "audio": ""
            }
        ]
    }
]